// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
//Console.ReadLine();
//Console.WriteLine();
// - однорядковий коментар
/* багаторядковий коментар
 * 
 */

//тип_даних ім'я змінної;
// назва змінної - починається з літери або _
// може містити будь-які символи, цифри та знак _
string address;
int value;
int Value = 10;
int myFirstValue;
value = 5;
Value = 5;
Console.WriteLine(value);
int a = 5;
int b = 10;
int result = a + b;
Console.WriteLine(result);

// System.Boolean, bool
bool f = false;

//System.Byte, byte 0 до 255
byte b1 = 222;
System.Byte b2 = 222;

//System.SByte, sbyte -128 до 127
//float 
b1 = byte.MinValue;

//char - символ ''
//string - рядок ""

//object - базовий тип
object o1 = 454;
object o2 = "H";
object o3 = 'H';

var k = 4;

//Літерали
//true false
//Двійкові (бінарні)
//0b
//0b00000100
//Вісімкові
//x=0125
//Шістнадцяткові
//0 1 2 3 4 5 6 7 8 9 A B C D E F 10 11 19 1A 1B 1F 20 2F 30 
//0x12, 0xFF, 0xFDA54
//Дійсні
//5.25 або 2.34e6=2.34*10^6
//2.73e-3 = 2.73*10^-3=0.00273
//Escape-послідовності
//\n - новий рядок 
//\t - табуляція
//\' - апостроф
//\" - подвійні лапки

//Арифметичні операції
//+
//-
//*
// /
// % - остача від ділення
// ++ - інкремент
// -- - декремент
int x = 10;
x++;
//Префіксна форма запису
int a1 = 5;
int b11 = ++a1; //a1=6, b11=6
//Постфіксна форма запису
int a12 = 5;
int b111 = a12++;
//a12=6, b111=5
//Оголошення змінної та ініціалізація змінної
int p, s, q; //оголошення змінної
p = 14; //ініціалізація
p = s = q = 100;
//Складені оператори присвоєння
//+=
//-=
//*=
///=
//%=
p += 10; //p=p+10;
//Умовні вирази
// ==
// !=
// >
// <
// >=
// <=
byte x1 = 1;
byte y1 = 3;
bool w = x1 >= y1; // false
bool w1 = x1 <= y1; // true
//Логічні операції 
//Оператор логічного заперечення - !
bool w2 = !w1; //false
//Оператор логічного додавання (диз'юнкція) (логічне або)
// | - повна диз'юнкція
// || - скорочене логічне додавання

bool b3 = (2 > 5) | (1 > 2); // false тому що, (2 > 5) - false, (1 > 2) - false
bool c = (2 < 5) | (1 < 2); // true тому що, (2 < 5) - true, (1 > 2) - false
bool d = (2 < 5) || (1 < 2); // true, оскільки (2 < 5) - true, то другий операнд не обчислюється

//Оператор логічного множення (кон'юнкція) (логічне і)
// & - повна кон'юнкція
// && - скорочене логічне множення

bool a7 = (2 < 5) & (1 < 2); // true тому що, (2 < 5) - true, (1 < 2) - true
bool b7 = (2 < 5) & (1 > 2); // false тому що, (2 < 5) - true, (1 > 2) - false
bool c7 = (1 > 4) && (1 < 2); // false, оскільки (1 > 4) - false, то другий операнд (1 < 2) не обчислюється

//Оператор логічного додавання за модулем ^ (xor)
bool a8 = (3 < 6) ^ (4 < 8); //false, обидва true
bool b9 = (2 < 5) ^ (1 > 2); //true

if (5>2)
{ 
    d = (3>5) | (4>5);
    b9 = (4>5) & (1>2);
}
else 
{
    a = 44;
}    